; domain
;; Gold Miner domain

(define (domain gold-miner-typed)
(:requirements :typing)
(:types LOC)

(:predicates
        (robot-at ?x - LOC)
        (bomb-at ?x - LOC )
        (laser-at ?x - LOC)
        (soft-rock-at ?x - LOC)
        (hard-rock-at ?x - LOC)
        (gold-at ?x - LOC)
        (arm-empty)
        (holds-bomb)
                (holds-laser)
        (holds-gold)
        (clear ?x - LOC)
        (connected ?x - LOC ?y - LOC)
)


; move to an adjacent empty grid location
(:action move
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (connected ?x ?y) (clear ?y))
  :effect (and (robot-at ?y) (not (robot-at ?x)))
)

(:action pickup-laser
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (laser-at ?x) (arm-empty))
  :effect (and (not (arm-empty)) (holds-laser) (not (laser-at ?x)) )
)

;have to be over the bomb location to pick the bomb
(:action pickup-bomb
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (bomb-at ?x) (arm-empty))
  :effect (and (not (arm-empty)) (holds-bomb))
)

(:action putdown-laser
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (holds-laser))
  :effect (and (arm-empty) (not (holds-laser)) (laser-at ?x))
)

;bomb an adjacent location that has soft-rock
(:action detonate-bomb
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (holds-bomb)
                     (connected ?x ?y) (soft-rock-at ?y))
  :effect (and (not (holds-bomb)) (arm-empty) (clear ?y) (not (soft-rock-at ?y)))
)

(:action fire-laser
  :parameters (?x - LOC ?y - LOC)
  :precondition (and (robot-at ?x) (holds-laser)
                     (connected ?x ?y))
  :effect (and (clear ?y) (not (soft-rock-at ?y)) (not (gold-at ?y))
               (not (hard-rock-at ?y)))
)

;mine gold !
;the robot has to be over the gold location to pick it up
(:action pick-gold
  :parameters (?x - LOC)
  :precondition (and (robot-at ?x) (arm-empty) (gold-at ?x))
  :effect (and (not (arm-empty)) (holds-gold))
)
)

; problem
(define (problem typed-bomberman-rows10-cols10-neargoal-d5)
(:domain gold-miner-typed)
(:objects f0-0f f0-1f f0-2f f0-3f f0-4f f0-5f f0-6f f0-7f f0-8f f0-9f f1-0f f1-1f f1-2f f1-3f f1-4f f1-5f f1-6f f1-7f f1-8f f1-9f f2-0f f2-1f f2-2f f2-3f f2-4f f2-5f f2-6f f2-7f f2-8f f2-9f f3-0f f3-1f f3-2f f3-3f f3-4f f3-5f f3-6f f3-7f f3-8f f3-9f f4-0f f4-1f f4-2f f4-3f f4-4f f4-5f f4-6f f4-7f f4-8f f4-9f f5-0f f5-1f f5-2f f5-3f f5-4f f5-5f f5-6f f5-7f f5-8f f5-9f f6-0f f6-1f f6-2f f6-3f f6-4f f6-5f f6-6f f6-7f f6-8f f6-9f f7-0f f7-1f f7-2f f7-3f f7-4f f7-5f f7-6f f7-7f f7-8f f7-9f f8-0f f8-1f f8-2f f8-3f f8-4f f8-5f f8-6f f8-7f f8-8f f8-9f f9-0f f9-1f f9-2f f9-3f f9-4f f9-5f f9-6f f9-7f f9-8f f9-9f - LOC)
(:init
(bomb-at f0-0f)
(clear f0-0f)
(clear f0-1f)
(clear f0-5f)
(clear f1-0f)
(clear f1-1f)
(clear f1-2f)
(clear f1-3f)
(clear f1-5f)
(clear f1-9f)
(clear f2-0f)
(clear f2-3f)
(clear f2-4f)
(clear f2-5f)
(clear f2-8f)
(clear f2-9f)
(clear f3-0f)
(clear f3-3f)
(clear f3-5f)
(clear f3-6f)
(clear f3-7f)
(clear f3-8f)
(clear f4-0f)
(clear f4-2f)
(clear f4-3f)
(clear f4-4f)
(clear f4-5f)
(clear f4-6f)
(clear f4-7f)
(clear f5-0f)
(clear f5-3f)
(clear f5-5f)
(clear f6-0f)
(clear f6-3f)
(clear f7-0f)
(clear f7-3f)
(clear f8-0f)
(clear f9-0f)
(connected f0-0f f0-1f)
(connected f0-0f f1-0f)
(connected f0-1f f0-0f)
(connected f0-1f f0-2f)
(connected f0-1f f1-1f)
(connected f0-2f f0-1f)
(connected f0-2f f0-3f)
(connected f0-2f f1-2f)
(connected f0-3f f0-2f)
(connected f0-3f f0-4f)
(connected f0-3f f1-3f)
(connected f0-4f f0-3f)
(connected f0-4f f0-5f)
(connected f0-4f f1-4f)
(connected f0-5f f0-4f)
(connected f0-5f f0-6f)
(connected f0-5f f1-5f)
(connected f0-6f f0-5f)
(connected f0-6f f0-7f)
(connected f0-6f f1-6f)
(connected f0-7f f0-6f)
(connected f0-7f f0-8f)
(connected f0-7f f1-7f)
(connected f0-8f f0-7f)
(connected f0-8f f0-9f)
(connected f0-8f f1-8f)
(connected f0-9f f0-8f)
(connected f0-9f f1-9f)
(connected f1-0f f0-0f)
(connected f1-0f f1-1f)
(connected f1-0f f2-0f)
(connected f1-1f f0-1f)
(connected f1-1f f1-0f)
(connected f1-1f f1-2f)
(connected f1-1f f2-1f)
(connected f1-2f f0-2f)
(connected f1-2f f1-1f)
(connected f1-2f f1-3f)
(connected f1-2f f2-2f)
(connected f1-3f f0-3f)
(connected f1-3f f1-2f)
(connected f1-3f f1-4f)
(connected f1-3f f2-3f)
(connected f1-4f f0-4f)
(connected f1-4f f1-3f)
(connected f1-4f f1-5f)
(connected f1-4f f2-4f)
(connected f1-5f f0-5f)
(connected f1-5f f1-4f)
(connected f1-5f f1-6f)
(connected f1-5f f2-5f)
(connected f1-6f f0-6f)
(connected f1-6f f1-5f)
(connected f1-6f f1-7f)
(connected f1-6f f2-6f)
(connected f1-7f f0-7f)
(connected f1-7f f1-6f)
(connected f1-7f f1-8f)
(connected f1-7f f2-7f)
(connected f1-8f f0-8f)
(connected f1-8f f1-7f)
(connected f1-8f f1-9f)
(connected f1-8f f2-8f)
(connected f1-9f f0-9f)
(connected f1-9f f1-8f)
(connected f1-9f f2-9f)
(connected f2-0f f1-0f)
(connected f2-0f f2-1f)
(connected f2-0f f3-0f)
(connected f2-1f f1-1f)
(connected f2-1f f2-0f)
(connected f2-1f f2-2f)
(connected f2-1f f3-1f)
(connected f2-2f f1-2f)
(connected f2-2f f2-1f)
(connected f2-2f f2-3f)
(connected f2-2f f3-2f)
(connected f2-3f f1-3f)
(connected f2-3f f2-2f)
(connected f2-3f f2-4f)
(connected f2-3f f3-3f)
(connected f2-4f f1-4f)
(connected f2-4f f2-3f)
(connected f2-4f f2-5f)
(connected f2-4f f3-4f)
(connected f2-5f f1-5f)
(connected f2-5f f2-4f)
(connected f2-5f f2-6f)
(connected f2-5f f3-5f)
(connected f2-6f f1-6f)
(connected f2-6f f2-5f)
(connected f2-6f f2-7f)
(connected f2-6f f3-6f)
(connected f2-7f f1-7f)
(connected f2-7f f2-6f)
(connected f2-7f f2-8f)
(connected f2-7f f3-7f)
(connected f2-8f f1-8f)
(connected f2-8f f2-7f)
(connected f2-8f f2-9f)
(connected f2-8f f3-8f)
(connected f2-9f f1-9f)
(connected f2-9f f2-8f)
(connected f2-9f f3-9f)
(connected f3-0f f2-0f)
(connected f3-0f f3-1f)
(connected f3-0f f4-0f)
(connected f3-1f f2-1f)
(connected f3-1f f3-0f)
(connected f3-1f f3-2f)
(connected f3-1f f4-1f)
(connected f3-2f f2-2f)
(connected f3-2f f3-1f)
(connected f3-2f f3-3f)
(connected f3-2f f4-2f)
(connected f3-3f f2-3f)
(connected f3-3f f3-2f)
(connected f3-3f f3-4f)
(connected f3-3f f4-3f)
(connected f3-4f f2-4f)
(connected f3-4f f3-3f)
(connected f3-4f f3-5f)
(connected f3-4f f4-4f)
(connected f3-5f f2-5f)
(connected f3-5f f3-4f)
(connected f3-5f f3-6f)
(connected f3-5f f4-5f)
(connected f3-6f f2-6f)
(connected f3-6f f3-5f)
(connected f3-6f f3-7f)
(connected f3-6f f4-6f)
(connected f3-7f f2-7f)
(connected f3-7f f3-6f)
(connected f3-7f f3-8f)
(connected f3-7f f4-7f)
(connected f3-8f f2-8f)
(connected f3-8f f3-7f)
(connected f3-8f f3-9f)
(connected f3-8f f4-8f)
(connected f3-9f f2-9f)
(connected f3-9f f3-8f)
(connected f3-9f f4-9f)
(connected f4-0f f3-0f)
(connected f4-0f f4-1f)
(connected f4-0f f5-0f)
(connected f4-1f f3-1f)
(connected f4-1f f4-0f)
(connected f4-1f f4-2f)
(connected f4-1f f5-1f)
(connected f4-2f f3-2f)
(connected f4-2f f4-1f)
(connected f4-2f f4-3f)
(connected f4-2f f5-2f)
(connected f4-3f f3-3f)
(connected f4-3f f4-2f)
(connected f4-3f f4-4f)
(connected f4-3f f5-3f)
(connected f4-4f f3-4f)
(connected f4-4f f4-3f)
(connected f4-4f f4-5f)
(connected f4-4f f5-4f)
(connected f4-5f f3-5f)
(connected f4-5f f4-4f)
(connected f4-5f f4-6f)
(connected f4-5f f5-5f)
(connected f4-6f f3-6f)
(connected f4-6f f4-5f)
(connected f4-6f f4-7f)
(connected f4-6f f5-6f)
(connected f4-7f f3-7f)
(connected f4-7f f4-6f)
(connected f4-7f f4-8f)
(connected f4-7f f5-7f)
(connected f4-8f f3-8f)
(connected f4-8f f4-7f)
(connected f4-8f f4-9f)
(connected f4-8f f5-8f)
(connected f4-9f f3-9f)
(connected f4-9f f4-8f)
(connected f4-9f f5-9f)
(connected f5-0f f4-0f)
(connected f5-0f f5-1f)
(connected f5-0f f6-0f)
(connected f5-1f f4-1f)
(connected f5-1f f5-0f)
(connected f5-1f f5-2f)
(connected f5-1f f6-1f)
(connected f5-2f f4-2f)
(connected f5-2f f5-1f)
(connected f5-2f f5-3f)
(connected f5-2f f6-2f)
(connected f5-3f f4-3f)
(connected f5-3f f5-2f)
(connected f5-3f f5-4f)
(connected f5-3f f6-3f)
(connected f5-4f f4-4f)
(connected f5-4f f5-3f)
(connected f5-4f f5-5f)
(connected f5-4f f6-4f)
(connected f5-5f f4-5f)
(connected f5-5f f5-4f)
(connected f5-5f f5-6f)
(connected f5-5f f6-5f)
(connected f5-6f f4-6f)
(connected f5-6f f5-5f)
(connected f5-6f f5-7f)
(connected f5-6f f6-6f)
(connected f5-7f f4-7f)
(connected f5-7f f5-6f)
(connected f5-7f f5-8f)
(connected f5-7f f6-7f)
(connected f5-8f f4-8f)
(connected f5-8f f5-7f)
(connected f5-8f f5-9f)
(connected f5-8f f6-8f)
(connected f5-9f f4-9f)
(connected f5-9f f5-8f)
(connected f5-9f f6-9f)
(connected f6-0f f5-0f)
(connected f6-0f f6-1f)
(connected f6-0f f7-0f)
(connected f6-1f f5-1f)
(connected f6-1f f6-0f)
(connected f6-1f f6-2f)
(connected f6-1f f7-1f)
(connected f6-2f f5-2f)
(connected f6-2f f6-1f)
(connected f6-2f f6-3f)
(connected f6-2f f7-2f)
(connected f6-3f f5-3f)
(connected f6-3f f6-2f)
(connected f6-3f f6-4f)
(connected f6-3f f7-3f)
(connected f6-4f f5-4f)
(connected f6-4f f6-3f)
(connected f6-4f f6-5f)
(connected f6-4f f7-4f)
(connected f6-5f f5-5f)
(connected f6-5f f6-4f)
(connected f6-5f f6-6f)
(connected f6-5f f7-5f)
(connected f6-6f f5-6f)
(connected f6-6f f6-5f)
(connected f6-6f f6-7f)
(connected f6-6f f7-6f)
(connected f6-7f f5-7f)
(connected f6-7f f6-6f)
(connected f6-7f f6-8f)
(connected f6-7f f7-7f)
(connected f6-8f f5-8f)
(connected f6-8f f6-7f)
(connected f6-8f f6-9f)
(connected f6-8f f7-8f)
(connected f6-9f f5-9f)
(connected f6-9f f6-8f)
(connected f6-9f f7-9f)
(connected f7-0f f6-0f)
(connected f7-0f f7-1f)
(connected f7-0f f8-0f)
(connected f7-1f f6-1f)
(connected f7-1f f7-0f)
(connected f7-1f f7-2f)
(connected f7-1f f8-1f)
(connected f7-2f f6-2f)
(connected f7-2f f7-1f)
(connected f7-2f f7-3f)
(connected f7-2f f8-2f)
(connected f7-3f f6-3f)
(connected f7-3f f7-2f)
(connected f7-3f f7-4f)
(connected f7-3f f8-3f)
(connected f7-4f f6-4f)
(connected f7-4f f7-3f)
(connected f7-4f f7-5f)
(connected f7-4f f8-4f)
(connected f7-5f f6-5f)
(connected f7-5f f7-4f)
(connected f7-5f f7-6f)
(connected f7-5f f8-5f)
(connected f7-6f f6-6f)
(connected f7-6f f7-5f)
(connected f7-6f f7-7f)
(connected f7-6f f8-6f)
(connected f7-7f f6-7f)
(connected f7-7f f7-6f)
(connected f7-7f f7-8f)
(connected f7-7f f8-7f)
(connected f7-8f f6-8f)
(connected f7-8f f7-7f)
(connected f7-8f f7-9f)
(connected f7-8f f8-8f)
(connected f7-9f f6-9f)
(connected f7-9f f7-8f)
(connected f7-9f f8-9f)
(connected f8-0f f7-0f)
(connected f8-0f f8-1f)
(connected f8-0f f9-0f)
(connected f8-1f f7-1f)
(connected f8-1f f8-0f)
(connected f8-1f f8-2f)
(connected f8-1f f9-1f)
(connected f8-2f f7-2f)
(connected f8-2f f8-1f)
(connected f8-2f f8-3f)
(connected f8-2f f9-2f)
(connected f8-3f f7-3f)
(connected f8-3f f8-2f)
(connected f8-3f f8-4f)
(connected f8-3f f9-3f)
(connected f8-4f f7-4f)
(connected f8-4f f8-3f)
(connected f8-4f f8-5f)
(connected f8-4f f9-4f)
(connected f8-5f f7-5f)
(connected f8-5f f8-4f)
(connected f8-5f f8-6f)
(connected f8-5f f9-5f)
(connected f8-6f f7-6f)
(connected f8-6f f8-5f)
(connected f8-6f f8-7f)
(connected f8-6f f9-6f)
(connected f8-7f f7-7f)
(connected f8-7f f8-6f)
(connected f8-7f f8-8f)
(connected f8-7f f9-7f)
(connected f8-8f f7-8f)
(connected f8-8f f8-7f)
(connected f8-8f f8-9f)
(connected f8-8f f9-8f)
(connected f8-9f f7-9f)
(connected f8-9f f8-8f)
(connected f8-9f f9-9f)
(connected f9-0f f8-0f)
(connected f9-0f f9-1f)
(connected f9-1f f8-1f)
(connected f9-1f f9-0f)
(connected f9-1f f9-2f)
(connected f9-2f f8-2f)
(connected f9-2f f9-1f)
(connected f9-2f f9-3f)
(connected f9-3f f8-3f)
(connected f9-3f f9-2f)
(connected f9-3f f9-4f)
(connected f9-4f f8-4f)
(connected f9-4f f9-3f)
(connected f9-4f f9-5f)
(connected f9-5f f8-5f)
(connected f9-5f f9-4f)
(connected f9-5f f9-6f)
(connected f9-6f f8-6f)
(connected f9-6f f9-5f)
(connected f9-6f f9-7f)
(connected f9-7f f8-7f)
(connected f9-7f f9-6f)
(connected f9-7f f9-8f)
(connected f9-8f f8-8f)
(connected f9-8f f9-7f)
(connected f9-8f f9-9f)
(connected f9-9f f8-9f)
(connected f9-9f f9-8f)
(gold-at f0-9f)
(hard-rock-at f0-2f)
(hard-rock-at f0-3f)
(hard-rock-at f0-4f)
(hard-rock-at f0-6f)
(hard-rock-at f1-4f)
(hard-rock-at f1-6f)
(hard-rock-at f1-8f)
(hard-rock-at f2-1f)
(hard-rock-at f2-2f)
(hard-rock-at f2-6f)
(hard-rock-at f3-1f)
(hard-rock-at f3-2f)
(hard-rock-at f3-4f)
(hard-rock-at f3-9f)
(hard-rock-at f4-1f)
(hard-rock-at f4-8f)
(hard-rock-at f5-1f)
(hard-rock-at f5-2f)
(hard-rock-at f5-4f)
(hard-rock-at f5-6f)
(hard-rock-at f5-9f)
(hard-rock-at f7-2f)
(hard-rock-at f7-4f)
(hard-rock-at f8-1f)
(hard-rock-at f8-4f)
(hard-rock-at f8-6f)
(hard-rock-at f9-8f)
(hard-rock-at f9-9f)
(holds-bomb)
(laser-at f0-0f)
(robot-at f2-8f)
(soft-rock-at f0-7f)
(soft-rock-at f0-8f)
(soft-rock-at f0-9f)
(soft-rock-at f1-7f)
(soft-rock-at f2-7f)
(soft-rock-at f4-9f)
(soft-rock-at f5-7f)
(soft-rock-at f5-8f)
(soft-rock-at f6-1f)
(soft-rock-at f6-2f)
(soft-rock-at f6-4f)
(soft-rock-at f6-5f)
(soft-rock-at f6-6f)
(soft-rock-at f6-7f)
(soft-rock-at f6-8f)
(soft-rock-at f6-9f)
(soft-rock-at f7-1f)
(soft-rock-at f7-5f)
(soft-rock-at f7-6f)
(soft-rock-at f7-7f)
(soft-rock-at f7-8f)
(soft-rock-at f7-9f)
(soft-rock-at f8-2f)
(soft-rock-at f8-3f)
(soft-rock-at f8-5f)
(soft-rock-at f8-7f)
(soft-rock-at f8-8f)
(soft-rock-at f8-9f)
(soft-rock-at f9-1f)
(soft-rock-at f9-2f)
(soft-rock-at f9-3f)
(soft-rock-at f9-4f)
(soft-rock-at f9-5f)
(soft-rock-at f9-6f)
(soft-rock-at f9-7f)
)
(:goal (and
(holds-gold)
))
)

; plan
1. (move f2-8f f2-9f)
   deleted: (robot-at f2-8f)
   added: (robot-at f2-9f)
   goals met: 0 of 1
2. (move f2-9f f1-9f)
   deleted: (robot-at f2-9f)
   added: (robot-at f1-9f)
   goals met: 0 of 1
3. (detonate-bomb f1-9f f0-9f)
   deleted: (holds-bomb) (soft-rock-at f0-9f)
   added: (arm-empty) (clear f0-9f)
   goals met: 0 of 1
4. (move f1-9f f0-9f)
   deleted: (robot-at f1-9f)
   added: (robot-at f0-9f)
   goals met: 0 of 1
5. (pick-gold f0-9f)
   deleted: (arm-empty)
   added: (holds-gold)
   goals met: 1 of 1
